'number' + 3 + 3 -> ‘number33’
//конкатенація стрінги з числом

null + 3 -> 3 
//null буде перетворено в 0

5 && "qwerty" -> "qwerty"
//5 це true, тому операнд && рухається далі і повертає останнє значення

+'40' + +'2' + "hillel" -> “42hillel” 
//+'40' та +'2' перетворяться на числа 40 і 2, далі конкатенація стрінги з числом

'10' - 5 === 6 -> false
// '10' буде перетворено в число, 10-5 це 5, 5 не дорівнює 6

true + false -> 1 
//true це 1, false це 0

'4px' - 3 -> NaN 
//'4px' не можна перетворити на число, будь-яка операція з NaN дасть NaN

'4' - 3 -> 1 
//'4' буде перетворено в число

'6' + 3 ** 0 -> ‘61’ 
//спочатку рахується ступінь, потім буде конкатенація стрінги з числом

12 / '6' -> 2
//'6' буде перетворено в число

'10' + (5 === 6) -> ‘10false’ 
//спочатку операція в дужках де 5 не дорівнює 6, це false; потім буде конкатенація стрінги з false

null == '' -> false
//null при == дорівнює тільки null або undefined

3 ** (9 / 3) -> 27
//спочатку виконається дія в дужках, потім 3 буде приведено до степеня

!!'false' == !!'true' -> true
//!! перетворить обидва вирази в true

0 || '0' && 1 -> 1
//спочатку виконається &&: '0' це true, 1 це теж true, тому поверне останнє значення; далі || шукає перший true

(+null == false) < 1 -> false
//початку виконається дія в дужках: +null перетвориться на 0, 0 дорівнює false це true, true це 1 

false && true || true -> true
//спочатку виконається && де результат буде false, далі || шукає перший true

false && (false || true) -> false 
//спочатку виконається дія в дужках де || шукає перший true, потім && шукає перший false

(+null == false) < 1 ** 5 -> true 
//спочатку виконається дія в дужках де +null це 0, 0 == false це true (або 1); потім 1 буде приведено до степеня
